[
  {
    "title": "Taking a Break",
    "date": "Oct 25 2023",
    "text": "<p>I'm addicted to chilling out and relaxing. I can't get enough of it. Every minute I want to stop what I'm doing and just sit back and do nothing.</p>\n<p>The problem is that once I'm doing nothing and \"relaxing\" I feel unproductive and that I'm wasting time.</p>\n<p><strong>There's no time</strong></p>\n<p>Maybe it's the current circumstances that I feel like I can't relax. Right now money is low and I haven't had a reliable income for quite some time. I feel like I'm on a short leash where I'm racing against time to earn my wage. So in a sense, I can't afford to relax right now. I should be working!</p>\n<p>I also should always be working because I'm in a start up. Work life balance was an easy thing when I didn't care about the work, but now the work <strong>is</strong> my life. Every moment not working is a hit on my future. I'll rest when I'm dead!</p>\n<p><strong>Resting</strong></p>\n<p>It's been pretty non stop for the past few months and some weeks I'm on top of my game and then there's other weeks where nothing gets done. The reasoning is burn out. I wish I could work like a machine but I cannot. Breaks are required.</p>\n<p><strong>How to take a break?</strong></p>\n<p>The problem is that's it's dangerously additive to take a break. Once I start relaxing I can't stop.</p>\n<p>It doesn't help that the world is profiting from selling ways to relax. Gaming is a recreational activity to unwind but ends up eating into every moment of my life. Once I start gaming I can't stop thinking about it. I'll drop everything to game the entire day away.</p>\n<p>Right now, there's a game I've been eyeing and it's on sale this week. Obviously one half of me wants to buy it. But the other half is concerned if this is a bad decision. This game will offer no benefit, it will be additive, it will be consuming, and it will give nothing in return except an easy way to waste time.</p>\n<p>What a crazy life; where I purposely have to avoid the things I enjoy.</p>\n<p>Which goes back to the question of how do I take a break?</p>\n<p>It can't be detrimental, like video games that are addictive and consume the rest of the day. Same with watching YouTube, it never leaves me satisfied. I always want to watch <em>one more video</em>.</p>\n<p>Other breaks don't give enough serotonin. Reading sometimes does but other times it's too demanding of a clear mind. I can't find the patience when I'm antsy and need some happiness right now!</p>\n<p>Writing is not a break. Writing feels more like work than work does. But at least writing is productive. That's why I write this tings. It's introspective, it exists, and increases my writing skill. But I don't know if it makes me feel relaxed or just more exhausted.</p>\n<p>I don't know how to take a break. I dislike being unproductive. And even unproductive activities are worse than just being unproductive, they're additive. But with no way to take a break from productivity, I inevitable crash.</p>\n<p><strong>Long breaks</strong></p>\n<p>Maybe the problem is the laziness to take a real break. Breaks these days is to remain at the workstation, just open a new tab or check the phone that's right there.</p>\n<p>I ought to get up and leave the space. Go outside (into the cold rainy weather that is fall) for the change of setting and fresh air.</p>\n<p>This is starting to sound like exhausting activities. Activities that require a break when I get home.</p>\n<p>I'm starting to get confused of what a break is at all now? An activity to do that when I'm not working? Recreational activity? For fun? I'm lost so we're gonna cut it here.</p>\n<p><strong>Conclusion</strong></p>\n<p>This \"break\" of writing has been unproductive.</p>\n"
  },
  {
    "title": "Neutrality",
    "date": "Oct 17 2023",
    "text": "<p><strong>Pre</strong></p>\n<p>I'm pretty sure I got the alcoholic DNA in my body. First step is acceptance, right. But after a long deep think on it, I decided I'm okay with alcoholism, and will happily embrace it.</p>\n<p>Let us examine my taste in this current era.</p>\n<ul>\n<li>I've finally accepted that I actually dislike the taste of wine. But if I have to choose, red &gt; white.</p>\n</li>\n<li>Beer gives a nostalgic refreshing feeling that's oh so nice for the first few sips. But I soon become bored of it and actually wish the drink to end.</p>\n</li>\n<li>I've always and still despise sugary drinks as I both hate pop and hangovers.</p>\n</li>\n<li>Cocktails are great, except that they're so expensive at the bar and the ones I make are always missing something.</p>\n</li>\n<li>Nothing is more communal than sharing a shot. Excellent fun to be shared or a fun daunting consequence in a drinking game. My ideal way.</p>\n</li>\n</ul>\n<p>I have recently discovered Nutrl 7s. Nutrl is a word that I will continuously fail to spell. Nutrl is a 5% zero sugar vodka soda. It definitely has an alcohol taste but it's as smooth, refreshing, and as easy to drink as a sparkling water. Now Nutrl 7 is the same thing, same cheap price... except it's 7% instead of 5. Who knew that a small 2% increase could change so much.</p>\n<p>One Nutrl 7 gets me buzzed. Two gets me drunk. Three gets me wasted. And four puts me to bed.</p>\n<p>It's actually too good. It's made all other alcohol irrelevant. Shopping at a liquor store used to have a feeling of \"what will it be tonight\". But now it's straight to the Nutrls. This is the new meta of drinking. And it might kill me.</p>\n<p><strong>Drunk, now what?</strong></p>\n<p>Why do I have a desire for drink?</p>\n<p>The buzz.</p>\n<p>It's undeniable that the initial buzz is a great feeling. A feeling of weightlessness. Everything feels pretty good and life is okay, isn't it. The only problem is that the initial buzz doesn't last long and only encourages more drinking beyond that start. \"Wow that first drink made me feel great, I should have a second...\". And it's all downhill from there.</p>\n<p>But I think the buzz is just a happy side affect of the desire to drink. I never open a drink with the sole intent of the buzz. The real intent is to let loose, to stop being so self conscious and just let actions flow. The desire to be free and a fool.</p>\n<p>Maybe this is a trait only for me. I am a self conscious person. I prefer to think and write about something before I feel ready to discuss it with someone. And being drunk allows me to skip that process. Alcohol is a tool.</p>\n<p>However, similar to most useful tools in the world, alcohol is a dangerous tool once you lose control of it. And boy did Nutrl 7s make that hella easy to do.</p>\n<p><strong>The morning afterwards</strong></p>\n<p>I used to enjoy hangovers. It was a nice excuse to be lazy, to sleep in, eat greasy food, and do nothing else. This was thinking back when I didn't really do anything in life. Now loosing a day's worth of productivity is a huge expense that's difficult to afford. A whole day wasted to only be left with vague memories.</p>\n<p><em>What was that fun from last night anyways?</em></p>\n<p>Everything becomes a little dreamy when I'm getting drunk. It's not really me that's controlling my body anymore, but a drunk alternative. I had a friend that went by a whole different name when they were drunk. And I'm starting to think that may be the correct way to think about.</p>\n<p>The night disappears and becomes just memories. I have a pretty good drunk memory, but it's not really my memory that I'm remembering. It's the drunk ego's actions that I'm watching. I'm not remembering the good time I had, but instead I'm rewatching my drunk ego enjoying themself. And I'm beginning to realize I don't like my drunk ego as a person.</p>\n<p>Uh oh, we're getting a little too pro-abstain here. Maybe it is true, the best amount of alcohol is no alcohol.</p>\n<p>I've done it, I've been the designated driver and done parties with just drinking water. I've even had a riot of a time with it. But it is missing that something.</p>\n<p>Moderation is the logical answer. But I think that loses the whole point. Part of the goal with drinking <em>is</em> to lose control. To Icarus your way up right before puking. To let loose.</p>\n<p>Letting loose. It feels like the possibilities are limitless, that the world is your oyster. The hangover is a lifetime away, and this moment, right now, can change a lifetime.</p>\n<p>It's a game of playing with fire. Control is what keeps us civilized, separate form the animals. But isn't it important to let the animal inside run through the open field every once in a while?</p>\n<p>I've really diverged here. I was just supposed to write a Neutral sponsorship blog.</p>\n"
  },
  {
    "title": "Barbie",
    "date": "Oct 13 2023",
    "text": "To be fair, it is not ideal to see a movie under these circumstances. I did the Barbenheimer: started in the afternoon with Oppenheimer, had a giant insane burger for dinner, and then went to see Barbie.</p>\n<p><strong>Side note</strong></p>\n<p>We went to a brewery for our dinner. What is up with brewery's having insanely delicious meals with their beer?</p>\n<p>And to continue the side note, having a giant greasy comforting meal is the perfect way to conclude Oppenheimer. There was a air of shock and awe from the movie that left my group and I speechless. We were all wowed and horrified. If I went straight home after seeing Oppenheimer I would just lie on the couch staring at the ceiling contemplating life. But instead, eating an insanely giant burger and watching a shallow comedy was the perfect way to decompress Oppenheimer, the ideal way to experience Oppenheimer</p>\n<p><strong>End Side Note</strong></p>\n<p>So these were not ideal conditions to experience Barbie. But none the less, after months later, Barbie still leaves a sour taste in my mouth.</p>\n<p>Just like most things that I find sour, I wouldn't be bothered if it wasn't so damn popular. But Barbie is the most popular movie in ages, although it's only legacy appears to be the humorous sexist memes that it birthed (girl math and girl dinner), the conclusion that Ryan Gosling is hilarious, and that the patriarchy is the source of problems... even though no one really knows what that means.</p>\n<p><strong>Barbie Land Plot</strong></p>\n<p>Exiting the movie, I feel like Barbie should not leave me feeling like \"Ken was Right\" and \"Down with Barbie\" but here we are. I wanted Girl Power, and instead I got the opposite. I really agree with the Kens, and see the Barbies as evil.</p>\n<p>In Barbie Land, the barbies were oppressive rulers over the Kens, ignorant of their own power. The Kens realized they didn't like life, and they fought for change to make their lives better. (the main hole in the plot is that we're not really sure how the Kens took power. They somehow convinced the Barbies to be their slaves, seemly done so their consent). Anyways, the Kens achieved a better life for themselves. How inspiring.</p>\n<p>So the Barbies scheme a plan of recruiting the brainwashed Barbies via guerilla tactics of kidnapping enslaved Barbies and... complaining and whining to snap them out of their brainwashed spell. \"Woman am I right... always just complaining eh\" (this is a JOKE!). The Barbies' plan continues with manipulating infighting among the Kens, to keep them distracted while the Barbies rig an election to power.</p>\n<p>The Kens are tricked and they start battling epic-ly amongst each other. But in the middle of combat, they realize that despite their differences, they're all just Ken after all. They should make love, not war, I know you've heard it before.</p>\n<p>It's too late though, the Barbies plan goes off without a hitch. They bring back the status quo of before and jokingly say they won't repress the Kens as badly as they used to (but obviously the Barbies keep majority power).</p>\n<p>Of course this ignores the arguably more main plot of motherhood, and it's message of being a neglectful mother is hard. We're just focusing on the Barbie/Ken dynamic.</p>\n<p><strong>Message?</strong></p>\n<p>How am I supposed to interpret this plot? What messaged am I supposed to take away?</p>\n<p>The classic argument is that Barbie is about the repression of females. Barbie Land is a gender reversal of power to exemplify it's point. Except this repression of power really has nothing to do with gender. The Kens are given typical masculinity traits and vice versa for the Barbies (the Ken's act like jerks and the Barbies are compassionate and complain a lot). But other than that, gender is never utilized in any meaningful way beyond a joke.</p>\n<p>Patriarchy is a buzz word thrown throughout. It's joked that Ken is inspired by patriarchy even though he has no idea what it means. Except if there's a patriarchy in Barbie, it would be the Barbies of Barbie Land. They start by ruling the land, and conclude by ruling the land. Patriarchy may have originally been male dominated, but it's 2023 now, patriarchy is genderless. While the show preaches an anti-patriarchy message, it's all talk while it's actions are more akin to pro-patriarchy? Actually is Barbie pro or anti anything?</p>\n<p>Barbie is the appearance of being meaningful, but constantly repeating a common fact about repression doesn't actually mean anything? Barbie does not walk it's talk. I'm not even sure if it's trying to walk anywhere.</p>\n<p>Wait... is Barbie... the embodiment of being woke?</p>\n<p>Barbie acts important, yelling a message that sounds important and brave. But it's actions are unrelated to it's speech, leaving it's loudly spoken words as just biennial talk.</p>\n<p>Serious topics are frequently brought up in the movie, commonly quite bluntly. But nothing is really said and the topics are soon forgotten after it's preachy joke is used up.</p>\n<p>Whether intentionally or not, Barbie encapsulates wokeness.</p>\n<p><strong>Conclusion</strong></p>\n<p>Everyone else loves Barbie. Is it me? What are others seeing that I'm not. Am I the fool looking too deeply into a movie that isn't supposed to be deep. Was it just supposed to be a fun commercial movie based on a consumerist product?</p>\n<p>I think I wanted Barbie to be important. I wanted a girl power movie with a strong feminist message that also got a viewership that's never been higher before. When Ryan Gosling started wearing the Tyler Durden fur coat and the Barbies started conducting terrorist activities akin to Project Mayhem; I knew then that I wanted Barbie to be Fight Club for girls. I wanted a movie for the new youth to be inspired by in this world of bullshit.</p>\n<p>I'm here to see my gynecologist.</p>\n"
  },
  {
    "title": "Streak",
    "date": "Oct 11 2023",
    "text": "<p>As temping as it is, I am not staying up past midnight to stay consistent with a daily upload.</p>"
  },
  {
    "title": "I wrote this instead of playing video games",
    "date": "Oct 10 2023",
    "text": "<p>Me and my gaming addition.</p>\n<p>One of the main reasons of creating this site has been trying to get off my gaming addition. Surely writing can replace the gaming urge...</p>\n<p>Back in the day I was a three hours of gaming a day kind of guy. Then two years ago I tried quitting and now I'm an on and off gamer where some days I'll binge a day or two and then feel pretty gross afterwards and not play for a week.</p>\n<p>Gaming is always on my mind. I'm watching videos of games, reading discussions about them, and articles of gaming news. Gaming is my feed. I dream of playing games.</p>\n<p>In actuality, most of the time playing games is borderline boring. But it's enough. It gives just exactly the bare minimum of serotonin.</p>\n<p>One of my favourite quotes summarizes my feelings. I only have a screenshot of the quote with no reference and I have no memory of where I found it:</p>\n<blockquote>\n<p>At any rate, he's wandering about, waiting for part of his brain to pity-fuck him some serotonin so there's not much else going on.</p>\n</blockquote>\n<p>The times I enjoy gaming are short lived and the rest just feels like a really efficient way to kill time.</p>\n<p>The main problem is that once I start, I have a real difficult time stopping. If I'm alone, and there's no one around to judge, I'll see no reason to stop. Gaming is just distracting enough that I won't realize how shitty it is while I'm playing and how much of a time waster this is.</p>\n<p>It's kind of similar to eating a bag of chips, and you know you've eaten too much, but you'll only truly realize how crappy you feel if you stop and get up. So you keep sitting down, eating that bag of chips and now you've really overeaten. And then the bag runs out and you're like \"fuckkk I ate too many chips\". The difference is that gaming doesn't need stop, you'll never run out of chips. The bag is endless.</p>\n<p>So I'm trying to quit gaming.</p>\n<p>Last July I did pretty good where I didn't touch a game at all the whole month. The thoughts and cravings disappeared and I almost forgot gaming even existed at all. I felt great for that month. But I couldn't avoid weekly game night with the boys forever. I played one game night and the following day I thought, \"damn I want to play some more\". And with that, it all went downhill from there.</p>\n<p>Video games have their use. They are fun, and they are an effective way to keep up with friends that are in the online distance. However, I can't causally enjoy just one gaming session, and I guess that's why they call it an addition.</p>\n<p>The problem is that it's really hard to avoid this addition. Gaming is incredibly socially acceptable, it's super cheap, and even if you get bored there's always new flavours of games to try out. The marketing is hype, analysis of games are interesting, games can be emotional, thoughtful, and all the while being designed to be as addictive as possible. They can be hella fun.</p>\n<p>I don't think I can remove gaming from my life style, it's an integral part of me. But god damn it's killing me today.</p>\n<p>There is the option of going cold turkey. Deleting all my games from my computer and all that. But that seems pretty drastic. I can't do that, I got game night with the boys every week. It's a real dilemma.</p>\n<p>Today I've been getting no work done as my mind is drifting to get a hit of gaming. I was hoping writing would get my mind decompressed and focused, but I feel no different from when I started.</p>\n<p>Today has been a wasteful day.</p>\n"
  },
  {
    "title": "Why is this website so ugly?",
    "date": "Oct 9 2023",
    "text": "<p>An explanation of why this website is so ugly.</p><p>I like the idea of barebone websites, and this is the result. This website is comprised of just six files.</p><ul><li>your foundational html</li><li>a css file for styles</li><li>a json file for storing the posts</li><li>a javascript file for listing the posts</li><li>and two files for tailwindcss (which is almost unnecessary as the site is so small I could have just used old school css )</li></ul><p>For the non website people, most websites made from scratch are made from a library that includes a lot of shortcuts and that makes it easy and convenient to add complex features. No one in the modern era create websites from scratch.</p><p>However, it's nice to make a barebone website without using a library. It's humbling to go back to the basics, doing everything by scratch.</p><p>It's actually not humbling. It's a pain in the ass. It's frustrating to try to do stuff that was thoughtless in React and try to do it with a javascript script file. I'm pretty restricted in adding new features to this website with the barebones method. I'm limited to a single page, and adding new functions is pretty inconvenient.</p><p>There is one major bonus of a barebone site. There's zero build time. While website library frameworks are easy to code websites with all it's fancy tools, it has to execute a build command that takes all that code and builds it into html, javascript, and css. My current actual work website takes about 5 minutes to build which is pretty annoying. But with this website already at the foundation, there's simply nothing to build. So deploying this website is kind of cool to be instant.</p><p>I also like the idea of having no backend on a website. All the website's data is on the site, instead of storing the data on a database. The result is that since data doesn't need to be fetched, the site will have nothing to load and is super fast.</p><p>The actual result is that the site would probably be instantly fast anyways if I had a backend database because text blog posts is an insignificantly small amount of data. And now it's a pain to update the data because I have to open up all the code, edit my json file where I keep the posts, and build the site just to show a new post. Except building is instant so it's not that bad.</p><h2>Designing</h2><p>However, this barebone build approach isn't any excuse for this site looking so ugly. That's all design.</p><p>Making websites is interesting cause it's both extremely technical to code, but also it requires a high degree of creativity due to the limitless possibilities. It's fun. However, my brain can't do both. The more fancy something is to dream, the more work is required to make. So every time I design I keep thinking: why would I inflict more pain onto myself. So I just tend to leave things as basic as possible. No effort.</p><p>Ah but it's all so ugly.</p><p>Designing is my weakness. As long as it works, it's good enough.</p><p>What I ought to do is find someone else's website and directly copy their design. But nothing really inspired me when I was making the site.</p><p>So for now, if a good looking website catches my eye later I'll copy it. Or maybe I ought to just sit down and spend some time actually thinking of a good design, but that'd be no fun.</p><h2 >Conclusions</h2><p>If I were to make a simple barebone website, I would not make it from scratch. I've been recommended Vit as a really fast quick website builder so I would probably try that.</p><p>As for my design flaw of not being able to design... well maybe I got to stop ignoring that aspect of website making and put the effort in to make it good. But I'll save that for a later date. For now, it works and is good enough.</p>"
  },
  {
    "title": "A New Start",
    "date": "Oct 8 2023",
    "text": "<p>This little website has been up for a few months now and it's been a failure. I wrote only five little things and they're all pretty worthless little thoughts. So I'm wiping the slate clean and starting again, this time with the intent of having the posts be longer and more focused on a topic. Daily consistently is probably beyond my reach but that would be cool.</p><p>Topics will most likely be pretty random and of very little interest to most. My brain mostly thinks of coding websites, my gaming addition, writing fiction but never writing, and anxiety. I feel a great passion for these topics and I hopefully that can translate to little posts that are interesting enough for me to reread.</p><p>This is a purely selfish activity of refreshing my brains thoughts into words. I suppose you could call it a therapy session.</p><p>Happy Thanksgiving.</p>"
  }
]
