[
  {
    "title": "Streak",
    "date": "Oct 11 2023",
    "text": "<p>As temping as it is, I am not staying up past midnight to stay consistent with a daily upload.</p>"
  },
  {
    "title": "I wrote this instead of playing video games",
    "date": "Oct 10 2023",
    "text": "<p>Me and my gaming addition.</p>\n<p>One of the main reasons of creating this site has been trying to get off my gaming addition. Surely writing can replace the gaming urge...</p>\n<p>Back in the day I was a three hours of gaming a day kind of guy. Then two years ago I tried quitting and now I'm an on and off gamer where some days I'll binge a day or two and then feel pretty gross afterwards and not play for a week.</p>\n<p>Gaming is always on my mind. I'm watching videos of games, reading discussions about them, and articles of gaming news. Gaming is my feed. I dream of playing games.</p>\n<p>In actuality, most of the time playing games is borderline boring. But it's enough. It gives just exactly the bare minimum of serotonin.</p>\n<p>One of my favourite quotes summarizes my feelings. I only have a screenshot of the quote with no reference and I have no memory of where I found it:</p>\n<blockquote>\n<p>At any rate, he's wandering about, waiting for part of his brain to pity-fuck him some serotonin so there's not much else going on.</p>\n</blockquote>\n<p>The times I enjoy gaming are short lived and the rest just feels like a really efficient way to kill time.</p>\n<p>The main problem is that once I start, I have a real difficult time stopping. If I'm alone, and there's no one around to judge, I'll see no reason to stop. Gaming is just distracting enough that I won't realize how shitty it is while I'm playing and how much of a time waster this is.</p>\n<p>It's kind of similar to eating a bag of chips, and you know you've eaten too much, but you'll only truly realize how crappy you feel if you stop and get up. So you keep sitting down, eating that bag of chips and now you've really overeaten. And then the bag runs out and you're like \"fuckkk I ate too many chips\". The difference is that gaming doesn't need stop, you'll never run out of chips. The bag is endless.</p>\n<p>So I'm trying to quit gaming.</p>\n<p>Last July I did pretty good where I didn't touch a game at all the whole month. The thoughts and cravings disappeared and I almost forgot gaming even existed at all. I felt great for that month. But I couldn't avoid weekly game night with the boys forever. I played one game night and the following day I thought, \"damn I want to play some more\". And with that, it all went downhill from there.</p>\n<p>Video games have their use. They are fun, and they are an effective way to keep up with friends that are in the online distance. However, I can't causally enjoy just one gaming session, and I guess that's why they call it an addition.</p>\n<p>The problem is that it's really hard to avoid this addition. Gaming is incredibly socially acceptable, it's super cheap, and even if you get bored there's always new flavours of games to try out. The marketing is hype, analysis of games are interesting, games can be emotional, thoughtful, and all the while being designed to be as addictive as possible. They can be hella fun.</p>\n<p>I don't think I can remove gaming from my life style, it's an integral part of me. But god damn it's killing me today.</p>\n<p>There is the option of going cold turkey. Deleting all my games from my computer and all that. But that seems pretty drastic. I can't do that, I got game night with the boys every week. It's a real dilemma.</p>\n<p>Today I've been getting no work done as my mind is drifting to get a hit of gaming. I was hoping writing would get my mind decompressed and focused, but I feel no different from when I started.</p>\n<p>Today has been a wasteful day.</p>\n"
  },
  {
    "title": "Why is this website so ugly?",
    "date": "Oct 9 2023",
    "text": "<p>An explanation of why this website is so ugly.</p><p>I like the idea of barebone websites, and this is the result. This website is comprised of just six files.</p><ul><li><p>your foundational html</p></li><li><p>a css file for styles</p></li><li><p>a json file for storing the posts</p></li><li><p>a javascript file for listing the posts</p></li><li><p>and two files for tailwindcss (which is almost unnecessary as the site is so small I could have just used old school css )</p></li></ul><p>For the non website people, most websites made from scratch are made from a library that includes a lot of shortcuts and that makes it easy and convenient to add complex features. No one in the modern era create websites from scratch.</p><p>However, it's nice to make a barebone website without using a library. It's humbling to go back to the basics, doing everything by scratch.</p><p>It's actually not humbling. It's a pain in the ass. It's frustrating to try to do stuff that was thoughtless in React and try to do it with a javascript script file. I'm pretty restricted in adding new features to this website with the barebones method. I'm limited to a single page, and adding new functions is pretty inconvenient.</p><p>There is one major bonus of a barebone site. There's zero build time. While website library frameworks are easy to code websites with all it's fancy tools, it has to execute a build command that takes all that code and builds it into html, javascript, and css. My current actual work website takes about 5 minutes to build which is pretty annoying. But with this website already at the foundation, there's simply nothing to build. So deploying this website is kind of cool to be instant.</p><p>I also like the idea of having no backend on a website. All the website's data is on the site, instead of storing the data on a database. The result is that since data doesn't need to be fetched, the site will have nothing to load and is super fast.</p><p>The actual result is that the site would probably be instantly fast anyways if I had a backend database because text blog posts is an insignificantly small amount of data. And now it's a pain to update the data because I have to open up all the code, edit my json file where I keep the posts, and build the site just to show a new post. Except building is instant so it's not that bad.</p><h2>Designing</h2><p>However, this barebone build approach isn't any excuse for this site looking so ugly. That's all design.</p><p>Making websites is interesting cause it's both extremely technical to code, but also it requires a high degree of creativity due to the limitless possibilities. It's fun. However, my brain can't do both. The more fancy something is to dream, the more work is required to make. So every time I design I keep thinking: why would I inflict more pain onto myself. So I just tend to leave things as basic as possible. No effort.</p><p>Ah but it's all so ugly.</p><p>Designing is my weakness. As long as it works, it's good enough.</p><p>What I ought to do is find someone else's website and directly copy their design. But nothing really inspired me when I was making the site.</p><p>So for now, if a good looking website catches my eye later I'll copy it. Or maybe I ought to just sit down and spend some time actually thinking of a good design, but that'd be no fun.</p><h2 >Conclusions</h2><p>If I were to make a simple barebone website, I would not make it from scratch. I've been recommended Vit as a really fast quick website builder so I would probably try that.</p><p>As for my design flaw of not being able to design... well maybe I got to stop ignoring that aspect of website making and put the effort in to make it good. But I'll save that for a later date. For now, it works and is good enough.</p>"
  },
  {
    "title": "A New Start",
    "date": "Oct 8 2023",
    "text": "<p>This little website has been up for a few months now and it's been a failure. I wrote only five little things and they're all pretty worthless little thoughts. So I'm wiping the slate clean and starting again, this time with the intent of having the posts be longer and more focused on a topic. Daily consistently is probably beyond my reach but that would be cool.</p><p>Topics will most likely be pretty random and of very little interest to most. My brain mostly thinks of coding websites, my gaming addition, writing fiction but never writing, and anxiety. I feel a great passion for these topics and I hopefully that can translate to little posts that are interesting enough for me to reread.</p><p>This is a purely selfish activity of refreshing my brains thoughts into words. I suppose you could call it a therapy session.</p><p>Happy Thanksgiving.</p>"
  }
]
